/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   simpleEnable_If4_byMesherin.cpp                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/13 21:19:00 by areggie           #+#    #+#             */
/*   Updated: 2022/04/13 21:25:08 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Источник https://www.youtube.com/watch?v=t2xYX8-xwvY

Часть про Enable_if на видео с 29:25 по 50:25

Код очень похож на код из предыдущих 3 файлов про EnableIF

Позже можно прописать
*/

