/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   inline_key_word.cpp                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/10 16:17:42 by areggie           #+#    #+#             */
/*   Updated: 2022/05/10 16:40:53 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.youtube.com/watch?v=TGwl3tJYFRg

https://www.youtube.com/watch?v=onKnrNJZRbs

inline c++ что это.
Ключевое слово inline.
Встраиваемая функция. 
C++ для начинающих. Урок #39


ключевое слово inline перед функцией заставляет компилятор выполнять
функцию непосредственно в main (куда функция ранее вызывалась, inline просто
"вшивает" ее в main)

Нашел это ключевое слово в С++ STL у Степанова 
стандарт 98 года

В современных стандартах компилятор уже самостоятельно использует вшивание
в main 
поэтому просто inline уже не используется

*/